---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings.CircuitNamingSchemeId
source: html/2cc3d296-fb16-e1b4-b2f3-b344702d11a2.htm
---
# Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings.CircuitNamingSchemeId Property

The circuit naming scheme id set in CircuitNamingSchemeSettings.

## Syntax (C#)
```csharp
public ElementId CircuitNamingSchemeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The circuit naming scheme id is invalid for the CircuitNamingSchemeSettings.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null